driver-tests/databasebc/Derby/InsertJbi/test/TestInsert/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tab="http://j2ee.netbeans.org/xsd/tableSchema">
  <soapenv:Body>
    <tab:TestTable>
      <tab:TestSal>10</tab:TestSal>
      <tab:TestID>100</tab:TestID>
      <tab:TestFlag>0</tab:TestFlag>
      <tab:TestName>Insert</tab:TestName>
    </tab:TestTable>
  </soapenv:Body>
</soapenv:Envelope>