driver-tests/jdbcbc/DB2/Find_Db2_JBI/test/TestFindDb2/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <TestTable xmlns="http://j2ee.netbeans.org/xsd/tableSchema">
      <TestSal>4000</TestSal>
      <TestID>4</TestID>
      <TestFlag>0</TestFlag>
      <TestName>UpdateDb2</TestName>
    </TestTable>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
